import questionary
import emoji
import re


def mode_one():
    print(f"{emoji.emojize(':hammer_and_wrench:')} Обрано режим 1: Створення звіту на основі всіх файлів.")


def mode_two():
    print(f"{emoji.emojize(':bar_chart:')} Обрано режим 2: Створення звіту по даті і області.")

    regions = ["АР Крим","Вінницька область","Волинська область","Дніпропетровська область","Донецька область","Житомирська область","Закарпатська область","Запорізька область","Івано-Франківська область","Київська область","Кіровоградська область","Луганська область","Львівська область","Миколаївська область","Одеська область","Полтавська область","Рівненська область","Сумська область","Тернопільська область","Харківська область","Херсонська область","Хмельницька область","Черкаська область","Чернівецька область","Чернігівська область","м. Київ","м.Севастополь"]

    selected_modes = questionary.checkbox(
        "Оберіть області для звіту, можна обрати відразу декілька областей:",
        choices=regions
    ).ask()

    if not selected_modes:
        print("Ви нічого не обрали. Програма завершена.")
        return

    region_pattern = r"\d{2}\_\d{4}\-\d{2}\_\d{4}"

    while True:
        setting2 = input("Введіть місяць та рік на основі яких формувати звіт в форматі 01_2025-05_2025: ")
        if re.fullmatch(region_pattern, setting2):
            break
        else:
            print("Ви ввели дані у невірному форматі. Спробуйте ще раз.")

    chunks = setting2.split("-")
    print("chunks:", chunks)



    print(f"Обрані налаштування: Область={selected_modes}, Дата={setting2}")



def main():
    greeting = [
        f"{emoji.emojize(':police_officer:')} Привіт, це скрипт який допомагає зформувати статистику затримань по всій Україні.",
        f"{emoji.emojize(':classical_building:')} Розроблений для Департаменту головної інспекції та дотримання прав людини."
    ]
    print(greeting[0]) #show message 1
    print(greeting[1]) #show message 2

    choice = questionary.select(
        "Оберіть режим роботи скрипта:",
        choices=[
            "Звіт на основі всіх файлів",
            "Звіт по даті і області",
        ]).ask()

    if choice == "Звіт на основі всіх файлів":
        mode_one()
    elif choice == "Звіт по даті і області":
        mode_two()
    else:
        print("Помилка.")


if __name__ == "__main__":
    main()
